function sum(num1) {
  return function(num2) {
    alert(num1 + num2);
  }
}
const sum1 = sum(1);
sum1(2);


for (let i = 1; i <= 10; i++) {
  setTimeout(function() { 
    console.log(i);   
  }, 0);
}

//  Помилка коду в тому, що обявлення зміної відбувається за допомогою ключового слова var. Var має хостинг(тобто перед запуском скрипта var спливає вверх файла) і не має блочної області видимості конструкції for. Оскільки setTimeout це АРІ браузера а не JavaScript, тому коли інтерпретатор запускає код, то спочатку спрацьовуватиме цикл до тих пір, поки і не досягне значення 10, а потім запуститься setTimeout. Для вирішення задачі замість var використаємо let (const не можна бо це константа, яку не міняємо). Для let і const існує блочна область видимості. Вони також спливають наверх блока але потребують ініціалізації. Тому виведення і в консолі буде після кожної ітерації циклу.